2F/Operating_Systems/Lab-4/docs.org
#+options: toc:nil title:nil numbers:nil

=.Homework=

* NAME

Homework - Read and print the contents of files with options.

* SYNOPSIS

*Homework* [OPTIONS] FILE...

* DESCRIPTION

*Homework* reads the contents of files and prints them to the standard output line by line. It provides options to control printing behavior.

* OPTIONS

- **-h, --help**: Display this help message.
- **-r, --reverse**: Reverse each line before printing.
- **-d DELAY, --delay DELAY**: Specify a delay in seconds or fractions thereof. Example: -d 0.5 for a 500 milliseconds delay.

* FILES

The FILE argument(s) should be the names of the files whose contents need to be printed.

* RETURN VALUE

- 0 on success.
- 1 on error, such as file not found.
- All other results printed to STDOUT

* SEE ALSO

- [man(1)](https://linux.die.net/man/1/man)
- [getopt(3)](https://linux.die.net/man/3/getopt)
- [usleep(3)](https://linux.die.net/man/3/usleep)
- [fprintf(3)](https://linux.die.net/man/3/fprintf)

* AUTHORS

Christian Johnson


